nose-case2/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    top
    {
        type        fixedValue;
        value       uniform (0 0 0);
    }

    bottom
    {
        type        fixedValue;
        value       uniform (0 0 0);
    }

    left
    {
        type            fixedValue;
        value           uniform (0 -1 0);
    }

    right
    {
        // type		outletInlet;
        // outletValue	uniform (1 0 0);
        type        zeroGradient;
    }

    front
    {
        type        fixedValue;
        value       uniform (0 0 0);
    }

    back
    {
        type        fixedValue;
        value       uniform (0 0 0);
    }

    nose
    {
        type        fixedValue;
        value       uniform (0 0 0);
    }
}


// ************************************************************************* //
