nose-case2/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p|U|k|epsilon)"
    {
        solver      GAMG;
        tolerance   1e-06;
        relTol      0;

        smoother    GaussSeidel;

        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator faceAreaPair;
        mergeLevels 1;
    };
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
    consistent true; // SIMPLEC

    residualControl
    {
        "(p|U|k|epsilon)" 1e-08;
    }
}

relaxationFactors
{
    p               0.5;
    U               0.1;
    k               0.3;
    epsilon         0.3;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

